/* This Source Code Form is subject to the terms of the Mozilla Public
 * License, v. 2.0. If a copy of the MPL was not distributed with this
 * file, You can obtain one at https://mozilla.org/MPL/2.0/. */

/// <https://drafts.csswg.org/css-text-4/#small-kana>
pub(crate) static SMALL_KANA_MAPPINGS: phf::Map<char, char> = phf::phf_map! {
    '\u{3041}' => '\u{3042}', // ぁ → あ
    '\u{3043}' => '\u{3044}', // ぃ → い
    '\u{3045}' => '\u{3046}', // ぅ → う
    '\u{3047}' => '\u{3048}', // ぇ → え
    '\u{3049}' => '\u{304A}', // ぉ → お
    '\u{3095}' => '\u{304B}', // ゕ → か
    '\u{3096}' => '\u{3051}', // ゖ → け
    '\u{1B132}' => '\u{3053}', // 𛄲 → こ
    '\u{3063}' => '\u{3064}', // っ → つ
    '\u{3083}' => '\u{3084}', // ゃ → や
    '\u{3085}' => '\u{3086}', // ゅ → ゆ
    '\u{3087}' => '\u{3088}', // ょ → よ
    '\u{308E}' => '\u{308F}', // ゎ → わ
    '\u{1B150}' => '\u{3090}', // 𛅐 → ゐ
    '\u{1B151}' => '\u{3091}', // 𛅑 → ゑ
    '\u{1B152}' => '\u{3092}', // 𛅒 → を
    '\u{30A1}' => '\u{30A2}', // ァ → ア
    '\u{30A3}' => '\u{30A4}', // ィ → イ
    '\u{30A5}' => '\u{30A6}', // ゥ → ウ
    '\u{30A7}' => '\u{30A8}', // ェ → エ
    '\u{30A9}' => '\u{30AA}', // ォ → オ
    '\u{30F5}' => '\u{30AB}', // ヵ → カ
    '\u{31F0}' => '\u{30AF}', // ㇰ → ク
    '\u{30F6}' => '\u{30B1}', // ヶ → ケ
    '\u{1B155}' => '\u{30B3}', // 𛅕 → コ
    '\u{31F1}' => '\u{30B7}', // ㇱ → シ
    '\u{31F2}' => '\u{30B9}', // ㇲ → ス
    '\u{30C3}' => '\u{30C4}', // ッ → ツ
    '\u{31F3}' => '\u{30C8}', // ㇳ → ト
    '\u{31F4}' => '\u{30CC}', // ㇴ → ヌ
    '\u{31F5}' => '\u{30CF}', // ㇵ → ハ
    '\u{31F6}' => '\u{30D2}', // ㇶ → ヒ
    '\u{31F7}' => '\u{30D5}', // ㇷ → フ
    '\u{31F8}' => '\u{30D8}', // ㇸ → ヘ
    '\u{31F9}' => '\u{30DB}', // ㇹ → ホ
    '\u{31FA}' => '\u{30E0}', // ㇺ → ム
    '\u{30E3}' => '\u{30E4}', // ャ → ヤ
    '\u{30E5}' => '\u{30E6}', // ュ → ユ
    '\u{30E7}' => '\u{30E8}', // ョ → ヨ
    '\u{31FB}' => '\u{30E9}', // ㇻ → ラ
    '\u{31FC}' => '\u{30EA}', // ㇼ → リ
    '\u{31FD}' => '\u{30EB}', // ㇽ → ル
    '\u{31FE}' => '\u{30EC}', // ㇾ → レ
    '\u{31FF}' => '\u{30ED}', // ㇿ → ロ
    '\u{30EE}' => '\u{30EF}', // ヮ → ワ
    '\u{1B164}' => '\u{30F0}', // 𛅤 → ヰ
    '\u{1B165}' => '\u{30F1}', // 𛅥 → ヱ
    '\u{1B166}' => '\u{30F2}', // 𛅦 → ヲ
    '\u{1B167}' => '\u{30F3}', // 𛅧 → ン
    '\u{FF67}' => '\u{FF71}', // ｧ → ｱ
    '\u{FF68}' => '\u{FF72}', // ｨ → ｲ
    '\u{FF69}' => '\u{FF73}', // ｩ → ｳ
    '\u{FF6A}' => '\u{FF74}', // ｪ → ｴ
    '\u{FF6B}' => '\u{FF75}', // ｫ → ｵ
    '\u{FF6F}' => '\u{FF82}', // ｯ → ﾂ
    '\u{FF6C}' => '\u{FF94}', // ｬ → ﾔ
    '\u{FF6D}' => '\u{FF95}', // ｭ → ﾕ
    '\u{FF6E}' => '\u{FF96}',  // ｮ → ﾖ
};
